# 1. Write a function to swap the first and last characters in a string.
# RU: Напишите функцию, чтобы поменять местами первый и последний символы в строке.
# =================================================================================
# =================================================================================
# 2. Write a function to reverse a string.
# RU: Напишите функцию, чтобы перевернуть строку.
# =================================================================================
# =================================================================================
# 3. Write a function to remove the nth index character from a n onempty string.
# RU: Напишите функцию, чтобы удалить символ с индексом n из непустой строки.
# =================================================================================
# =================================================================================
# 4. Write a function to remove the characters which have odd index values of a given string.
# RU: Напишите функцию, чтобы удалить символы, которые имеют нечетные индексы заданной строки.
# =================================================================================
# =================================================================================
# 5. Write a Python script that takes input from the user and displays
# that input back in upper and lower cases.
# RU: Напишите скрипт Python, который принимает ввод от пользователя и
# отображает этот ввод в верхнем и нижнем регистрах.
# =================================================================================
# =================================================================================
# 6. Write a function to find the second most frequent character in a given string.
# RU: Напишите функцию, чтобы найти второй наиболее часто встречающийся символ в данной строке.
# второй_наиболее_часто_встречающийся
# =================================================================================
# =================================================================================
# 7. Write a function to convert a given string into a list of integers.
# RU: Напишите функцию, чтобы преобразовать заданную строку в список целых чисел.
# =================================================================================
# =================================================================================
# 8. Write a function to check if a given string is a palindrome.
# RU: Напишите функцию, чтобы проверить, является ли заданная строка палиндромом.
# =================================================================================
# =================================================================================
# 9. Write a Python program to get a string made of the first 2 and last 2 characters of a given string.
# If the string length is less than 2, return the empty string instead.
# RU: Напишите программу на Python, чтобы получить строку, состоящую из первых 2 и последних 2 символов заданной строки.
# Если длина строки меньше 2, вместо этого верните пустую строку.
# =================================================================================
# =================================================================================
# 10. Write a Python program to get a string from a given string where all occurrences of its first char
# have been changed to '$', except the first char itself.
# RU: Напишите программу на Python, чтобы получить строку из заданной строки, где все вхождения ее первого символа
# были заменены на '$', кроме самого первого символа.

# INPUT:   =>  "This is test text"
# OUTPUT:  =>  "This is $es$ $ex$"
# изменить_первый_символ
# =================================================================================
# =================================================================================
# 11. Write a Python program to get a single string from two given strings, separated by a space and
# swap the first two characters of each string.
# RU: Напишите программу на Python, чтобы получить одну строку из двух заданных строк, разделенных пробелом и
# поменять местами первые два символа каждой строки.
# =================================================================================
# =================================================================================
# 12. Write a Python program to add 'ing' at the end of a given string (length should be at least 3). If the given string
# already ends with 'ing', add 'ly' instead. If the string length of the given string is less than 3, leave it unchanged.
# RU: Напишите программу на Python, чтобы добавить 'ing' в конец заданной строки (длина должна быть не менее 3).
# Если заданная строка уже заканчивается на 'ing', вместо этого добавьте 'ly'.
# Если длина строки заданной строки меньше 3, оставьте ее без изменений.
# =================================================================================
# =================================================================================
# 13. Write a Python program to find the first appearance of the substrings 'not' and 'poor' in a given string.
# If 'not' follows 'poor', replace the whole 'not'...'poor' substring with 'good'. Return the resulting string.
# RU: Напишите программу на Python, чтобы найти первое появление подстрок «не» и «плохо» в заданной строке.
# Если «не» следует за «плохо», замените всю подстроку «не» ... «плохо» на «хорошо». Вернуть полученную строку.
# =================================================================================
# =================================================================================
# 14. Write a Python function to create an HTML string with tags around the word(s)
# RU: Напишите функцию Python для создания HTML-строки с тегами вокруг слова (слов).
# =================================================================================
# =================================================================================
# 15. Write a Python function to insert a string in the middle of a string.
# RU: Напишите функцию Python для вставки строки посередине строки.
# вставить_строку_посередине
# =================================================================================
# =================================================================================
# 16. Write a Python function to get a string made of 4 copies of the last two characters of a specified string
# RU: Напишите функцию Python, чтобы получить строку, состоящую из 4 копий последних двух символов заданной строки
# =================================================================================
# =================================================================================
# 17. Write a Python function to get a string made of the first three characters of a specified string.
# If the length of the string is less than 3, return the original string.
# RU: Напишите функцию Python, чтобы получить строку, состоящую из первых трех символов заданной строки.
# Если длина строки меньше 3, вернуть исходную строку.
# =================================================================================
# =================================================================================
# 18. Write a Python function to get the first half of a specified string of even length.
# RU: Напишите функцию Python, чтобы получить первую половину заданной строки четной длины.
# =================================================================================
# =================================================================================
# 19. Write a Python program to concatenate two strings and return the result.
# If the length of the strings are not same then remove the characters from the longer string.
# RU: Напишите программу на Python для объединения двух строк и верните результат. Если длины строк не одинаковы,
# то удалите символы из более длинной строки.
# =================================================================================
# =================================================================================
# 20. Write a Python function to convert a given string to all uppercase if it contains
# at least 2 uppercase characters in the first 4 characters.
# RU: Напишите функцию Python для преобразования заданной строки в верхний регистр, если она содержит
# не менее 2 заглавных символов в первых 4 символах.
