# SEQUENCE

# str, list, tuple, range
# 1. "Hello world"
# 2. []
#       x = ['text-1',  'text-2']
#       x[0][3]  # ->  't' 
#       x[0] = 1   # =>  [1,  'text-2']
# 3. tuple
#       x = ('text-1',  'text-2')   # just like a const list
#       x[1]     => 'text-2'
#       x[1][1]  => 'e'
# 4. range   =>  диапазон
#       x = list(range(10))  =>  [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]


# ---------------------------------------------------------
# range(10)              => range(0, 10)   ->   object
# print(list(range(10)))
# list(range(10))        => [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# ---------------------------------------------------------
# range(10, 20)    #     => range(10, 20)
# print(list(range(10, 20)))   # => [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
# ---------------------------------------------------------
# range(10, 20, 2) #     => range(10, 20, 2)
# print(list(range(10, 20, 3)))   # => [10, 13, 16, 19]
# list(range(10, 20, 2)) => [10, 12, 14, 16, 18]
# ---------------------------------------------------------
# ---------------------------------------------------------
# for (let i=0; i<10; i++) {}
# for num in range(10):
#     print(num)
#     # num = num + 1
#     num += 1
# typeof([])        =>  object
# print(type([]))   =>  <class 'list'>
# ---------------------------------------------------------
# UPDATE
# x = ['a', 'b', 'c', 'd', 'e']
# x[1]  #  =>  'b'
# print(x[1:])  #  =>  ['b', 'c', 'd', 'e']
# print(x[:])

# a = x.copy()
# print(a is x)
# print(id(a))
# print(id(x))


# a[0] = 1
# print(a)
# print(x)
# ---------------------------------------------------------
# x = ['a', 'b', 'c', 'd', 'e']
# x[0:2] = 'w', 'z'
# x[0:] = 'w', 'z'
# print(x)

# x_list[...:...] = [...]   =>  updates from ... to ... by [...]
# ---------------------------------------------------------
# ADD
# x = ['a', 'b', 'c', 'd', 'e']

# x.append("WWW")
# print(x)

# x.insert(2, "WWW")
# print(x)
 
# x.extend([1, 2, 3])
# print(x)


# [].insert(position, element_to_add) => вставлять
# [].append()  =>  добавит элемент в конец листа
# [].extend()  =>  добавит элементы в конец листа
# ---------------------------------------------------------
# REMOVE
# x = ['a', 'b', 'c', 'd', 'e']
# if 'w' in x:
#     x.remove('w')

# del_item = x.pop(2)
# print("-->> ", del_item)
# print("-->> ", x)

# "..." in x  =>  проверяет есть ли элемент в листе
# [].pop()     =>  удаляет последний элемент
# [].remove()  =>  удаляет элемент по значению
# ---------------------------------------------------------
# COPY
# [].copy() => копирует лист
# ---------------------------------------------------------
# SORT
# [].sort(reverse=True)  => меняет оригинальный лист
# sorted([])             => не меняет оригинальный лист 
#                  и можно присвоить новой переменной
# x = ['w', 't', 'f', 'g', 'e']
# x.sort()
# a = sorted(x)
# print(x)
# print(a)

# ---------------------------------------------------------
# REVERSE
# [].reverse() =>  меняет оригинальный лист

# x = ['w', 't', 'f', 'g', 'e']
# # x.reverse()
# z = reversed(x)
# print(x)
# print(list(z))

